; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite3 - satellite
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	instrument15 - instrument
	instrument16 - instrument
	instrument17 - instrument
	satellite4 - satellite
	instrument18 - instrument
	instrument19 - instrument
	instrument20 - instrument
	instrument21 - instrument
	image4 - mode
	spectrograph2 - mode
	spectrograph1 - mode
	image0 - mode
	thermograph5 - mode
	thermograph6 - mode
	infrared3 - mode
	groundstation13 - direction
	groundstation7 - direction
	groundstation3 - direction
	star12 - direction
	groundstation0 - direction
	star11 - direction
	star2 - direction
	groundstation4 - direction
	groundstation1 - direction
	groundstation10 - direction
	groundstation6 - direction
	groundstation5 - direction
	star8 - direction
	star9 - direction
	phenomenon14 - direction
	star15 - direction
	planet16 - direction
	star17 - direction
	planet18 - direction
	planet19 - direction
	star20 - direction
	phenomenon21 - direction
	phenomenon22 - direction
	planet23 - direction
	phenomenon24 - direction
	phenomenon25 - direction
	planet26 - direction
	phenomenon27 - direction
	star28 - direction
	phenomenon29 - direction
	phenomenon30 - direction
	star31 - direction
	planet32 - direction
	planet33 - direction
	star34 - direction
	star35 - direction
	planet36 - direction
	phenomenon37 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 thermograph6)
	(calibration_target instrument0 groundstation0)
	(calibration_target instrument0 groundstation4)
	(calibration_target instrument0 groundstation7)
	(supports instrument1 thermograph5)
	(supports instrument1 image0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 groundstation4)
	(calibration_target instrument1 groundstation6)
	(calibration_target instrument1 groundstation7)
	(calibration_target instrument1 groundstation1)
	(supports instrument2 thermograph5)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared3)
	(calibration_target instrument2 groundstation7)
	(calibration_target instrument2 star2)
	(calibration_target instrument2 groundstation10)
	(calibration_target instrument2 star11)
	(supports instrument3 image0)
	(supports instrument3 spectrograph1)
	(supports instrument3 infrared3)
	(calibration_target instrument3 groundstation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 star11)
	(supports instrument4 thermograph5)
	(calibration_target instrument4 star2)
	(calibration_target instrument4 star12)
	(calibration_target instrument4 star11)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 groundstation1)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 groundstation1)
	(calibration_target instrument5 star11)
	(supports instrument6 image0)
	(supports instrument6 thermograph6)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 groundstation6)
	(calibration_target instrument6 groundstation5)
	(calibration_target instrument6 groundstation7)
	(supports instrument7 image0)
	(calibration_target instrument7 groundstation7)
	(calibration_target instrument7 star11)
	(calibration_target instrument7 star12)
	(calibration_target instrument7 star9)
	(supports instrument8 image0)
	(calibration_target instrument8 groundstation4)
	(calibration_target instrument8 groundstation10)
	(calibration_target instrument8 star9)
	(calibration_target instrument8 star8)
	(supports instrument9 thermograph5)
	(calibration_target instrument9 star11)
	(supports instrument10 image4)
	(supports instrument10 infrared3)
	(supports instrument10 spectrograph2)
	(calibration_target instrument10 groundstation3)
	(calibration_target instrument10 groundstation0)
	(supports instrument11 image0)
	(supports instrument11 thermograph6)
	(supports instrument11 thermograph5)
	(calibration_target instrument11 groundstation1)
	(calibration_target instrument11 star8)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(on_board instrument9 satellite2)
	(on_board instrument10 satellite2)
	(on_board instrument11 satellite2)
	(power_avail satellite2)
	(pointing satellite2 planet32)
	(supports instrument12 thermograph6)
	(supports instrument12 spectrograph2)
	(calibration_target instrument12 star9)
	(calibration_target instrument12 groundstation0)
	(calibration_target instrument12 star12)
	(supports instrument13 spectrograph2)
	(supports instrument13 thermograph5)
	(supports instrument13 thermograph6)
	(calibration_target instrument13 groundstation6)
	(calibration_target instrument13 groundstation4)
	(calibration_target instrument13 groundstation0)
	(supports instrument14 image4)
	(calibration_target instrument14 groundstation0)
	(supports instrument15 spectrograph2)
	(supports instrument15 image4)
	(supports instrument15 image0)
	(calibration_target instrument15 groundstation10)
	(calibration_target instrument15 star11)
	(calibration_target instrument15 groundstation6)
	(supports instrument16 infrared3)
	(calibration_target instrument16 groundstation4)
	(calibration_target instrument16 star2)
	(supports instrument17 spectrograph2)
	(calibration_target instrument17 star9)
	(calibration_target instrument17 groundstation6)
	(on_board instrument12 satellite3)
	(on_board instrument13 satellite3)
	(on_board instrument14 satellite3)
	(on_board instrument15 satellite3)
	(on_board instrument16 satellite3)
	(on_board instrument17 satellite3)
	(power_avail satellite3)
	(pointing satellite3 planet33)
	(supports instrument18 infrared3)
	(supports instrument18 spectrograph1)
	(supports instrument18 thermograph5)
	(calibration_target instrument18 groundstation1)
	(supports instrument19 image0)
	(supports instrument19 spectrograph1)
	(supports instrument19 thermograph6)
	(calibration_target instrument19 groundstation5)
	(calibration_target instrument19 groundstation6)
	(calibration_target instrument19 groundstation10)
	(supports instrument20 thermograph5)
	(calibration_target instrument20 star9)
	(supports instrument21 infrared3)
	(supports instrument21 thermograph6)
	(calibration_target instrument21 star9)
	(calibration_target instrument21 star8)
	(on_board instrument18 satellite4)
	(on_board instrument19 satellite4)
	(on_board instrument20 satellite4)
	(on_board instrument21 satellite4)
	(power_avail satellite4)
	(pointing satellite4 star15)
)
(:goal (and
	(pointing satellite0 phenomenon37)
	(pointing satellite1 planet36)
	(pointing satellite2 star11)
	(have_image phenomenon14 thermograph6)
	(have_image star15 thermograph5)
	(have_image planet16 image0)
	(have_image star17 thermograph6)
	(have_image planet19 spectrograph2)
	(have_image star20 infrared3)
	(have_image phenomenon21 thermograph5)
	(have_image phenomenon21 thermograph6)
	(have_image phenomenon22 spectrograph1)
	(have_image planet23 thermograph5)
	(have_image phenomenon24 thermograph5)
	(have_image phenomenon25 image4)
	(have_image phenomenon25 infrared3)
	(have_image planet26 infrared3)
	(have_image planet26 image4)
	(have_image phenomenon27 image0)
	(have_image star28 image0)
	(have_image star28 image4)
	(have_image phenomenon29 infrared3)
	(have_image phenomenon29 spectrograph1)
	(have_image phenomenon30 thermograph5)
	(have_image planet32 image0)
	(have_image planet32 infrared3)
	(have_image planet33 spectrograph1)
	(have_image planet33 spectrograph2)
	(have_image star34 spectrograph1)
	(have_image star35 spectrograph2)
	(have_image planet36 spectrograph2)
	(have_image phenomenon37 spectrograph2)
))
(:metric minimize (total-time))

)

; plan
1. (turn_to satellite2 star11 planet32)
   deleted: (pointing satellite2 planet32)
   added: (pointing satellite2 star11)
   goals met: 1 of 32
2. (turn_to satellite3 star17 planet33)
   deleted: (pointing satellite3 planet33)
   added: (pointing satellite3 star17)
   goals met: 1 of 32
3. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 1 of 32
4. (turn_to satellite1 planet36 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet36)
   goals met: 2 of 32
5. (switch_on instrument19 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument19)
   goals met: 2 of 32
6. (turn_to satellite4 groundstation10 star15)
   deleted: (pointing satellite4 star15)
   added: (pointing satellite4 groundstation10)
   goals met: 2 of 32
7. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 2 of 32
8. (switch_on instrument15 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument15)
   goals met: 2 of 32
9. (calibrate satellite0 instrument2 star11)
   added: (calibrated instrument2)
   goals met: 2 of 32
10. (turn_to satellite0 phenomenon37 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 phenomenon37)
   goals met: 3 of 32
11. (calibrate satellite4 instrument19 groundstation10)
   added: (calibrated instrument19)
   goals met: 3 of 32
12. (turn_to satellite4 phenomenon14 groundstation10)
   deleted: (pointing satellite4 groundstation10)
   added: (pointing satellite4 phenomenon14)
   goals met: 3 of 32
13. (turn_to satellite3 groundstation10 star17)
   deleted: (pointing satellite3 star17)
   added: (pointing satellite3 groundstation10)
   goals met: 3 of 32
14. (turn_to satellite0 phenomenon29 phenomenon37)
   deleted: (pointing satellite0 phenomenon37)
   added: (pointing satellite0 phenomenon29)
   goals met: 2 of 32
15. (take_image satellite4 phenomenon14 instrument19 thermograph6)
   added: (have_image phenomenon14 thermograph6)
   goals met: 3 of 32
16. (calibrate satellite3 instrument15 groundstation10)
   added: (calibrated instrument15)
   goals met: 3 of 32
17. (turn_to satellite3 phenomenon25 groundstation10)
   deleted: (pointing satellite3 groundstation10)
   added: (pointing satellite3 phenomenon25)
   goals met: 3 of 32
18. (take_image satellite3 phenomenon25 instrument15 image4)
   added: (have_image phenomenon25 image4)
   goals met: 4 of 32
19. (take_image satellite0 phenomenon29 instrument2 infrared3)
   added: (have_image phenomenon29 infrared3)
   goals met: 5 of 32
20. (take_image satellite0 phenomenon29 instrument2 spectrograph1)
   added: (have_image phenomenon29 spectrograph1)
   goals met: 6 of 32
21. (turn_to satellite4 phenomenon21 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 phenomenon21)
   goals met: 6 of 32
22. (turn_to satellite0 phenomenon37 phenomenon29)
   deleted: (pointing satellite0 phenomenon29)
   added: (pointing satellite0 phenomenon37)
   goals met: 7 of 32
23. (take_image satellite4 phenomenon21 instrument19 thermograph6)
   added: (have_image phenomenon21 thermograph6)
   goals met: 8 of 32
24. (turn_to satellite3 phenomenon27 phenomenon25)
   deleted: (pointing satellite3 phenomenon25)
   added: (pointing satellite3 phenomenon27)
   goals met: 8 of 32
25. (turn_to satellite3 star28 phenomenon27)
   deleted: (pointing satellite3 phenomenon27)
   added: (pointing satellite3 star28)
   goals met: 8 of 32
26. (turn_to satellite0 phenomenon21 phenomenon37)
   deleted: (pointing satellite0 phenomenon37)
   added: (pointing satellite0 phenomenon21)
   goals met: 7 of 32
27. (turn_to satellite4 phenomenon27 phenomenon21)
   deleted: (pointing satellite4 phenomenon21)
   added: (pointing satellite4 phenomenon27)
   goals met: 7 of 32
28. (take_image satellite0 phenomenon21 instrument2 thermograph5)
   added: (have_image phenomenon21 thermograph5)
   goals met: 8 of 32
29. (take_image satellite3 star28 instrument15 image4)
   added: (have_image star28 image4)
   goals met: 9 of 32
30. (take_image satellite3 star28 instrument15 image0)
   added: (have_image star28 image0)
   goals met: 10 of 32
31. (take_image satellite4 phenomenon27 instrument19 image0)
   added: (have_image phenomenon27 image0)
   goals met: 11 of 32
32. (turn_to satellite0 phenomenon37 phenomenon21)
   deleted: (pointing satellite0 phenomenon21)
   added: (pointing satellite0 phenomenon37)
   goals met: 12 of 32
33. (turn_to satellite3 phenomenon37 star28)
   deleted: (pointing satellite3 star28)
   added: (pointing satellite3 phenomenon37)
   goals met: 12 of 32
34. (turn_to satellite4 planet16 phenomenon27)
   deleted: (pointing satellite4 phenomenon27)
   added: (pointing satellite4 planet16)
   goals met: 12 of 32
35. (take_image satellite3 phenomenon37 instrument15 spectrograph2)
   added: (have_image phenomenon37 spectrograph2)
   goals met: 13 of 32
36. (turn_to satellite0 phenomenon24 phenomenon37)
   deleted: (pointing satellite0 phenomenon37)
   added: (pointing satellite0 phenomenon24)
   goals met: 12 of 32
37. (turn_to satellite4 phenomenon22 planet16)
   deleted: (pointing satellite4 planet16)
   added: (pointing satellite4 phenomenon22)
   goals met: 12 of 32
38. (take_image satellite0 phenomenon24 instrument2 thermograph5)
   added: (have_image phenomenon24 thermograph5)
   goals met: 13 of 32
39. (take_image satellite4 phenomenon22 instrument19 spectrograph1)
   added: (have_image phenomenon22 spectrograph1)
   goals met: 14 of 32
40. (turn_to satellite3 planet19 phenomenon37)
   deleted: (pointing satellite3 phenomenon37)
   added: (pointing satellite3 planet19)
   goals met: 14 of 32
41. (turn_to satellite0 phenomenon37 phenomenon24)
   deleted: (pointing satellite0 phenomenon24)
   added: (pointing satellite0 phenomenon37)
   goals met: 15 of 32
42. (take_image satellite3 planet19 instrument15 spectrograph2)
   added: (have_image planet19 spectrograph2)
   goals met: 16 of 32
43. (turn_to satellite4 star17 phenomenon22)
   deleted: (pointing satellite4 phenomenon22)
   added: (pointing satellite4 star17)
   goals met: 16 of 32
44. (take_image satellite4 star17 instrument19 thermograph6)
   added: (have_image star17 thermograph6)
   goals met: 17 of 32
45. (turn_to satellite0 phenomenon25 phenomenon37)
   deleted: (pointing satellite0 phenomenon37)
   added: (pointing satellite0 phenomenon25)
   goals met: 16 of 32
46. (turn_to satellite3 planet26 planet19)
   deleted: (pointing satellite3 planet19)
   added: (pointing satellite3 planet26)
   goals met: 16 of 32
47. (take_image satellite0 phenomenon25 instrument2 infrared3)
   added: (have_image phenomenon25 infrared3)
   goals met: 17 of 32
48. (take_image satellite3 planet26 instrument15 image4)
   added: (have_image planet26 image4)
   goals met: 18 of 32
49. (turn_to satellite4 planet32 star17)
   deleted: (pointing satellite4 star17)
   added: (pointing satellite4 planet32)
   goals met: 18 of 32
50. (turn_to satellite0 phenomenon37 phenomenon25)
   deleted: (pointing satellite0 phenomenon25)
   added: (pointing satellite0 phenomenon37)
   goals met: 19 of 32
51. (take_image satellite4 planet32 instrument19 image0)
   added: (have_image planet32 image0)
   goals met: 20 of 32
52. (turn_to satellite3 planet33 planet26)
   deleted: (pointing satellite3 planet26)
   added: (pointing satellite3 planet33)
   goals met: 20 of 32
53. (take_image satellite3 planet33 instrument15 spectrograph2)
   added: (have_image planet33 spectrograph2)
   goals met: 21 of 32
54. (turn_to satellite0 phenomenon30 phenomenon37)
   deleted: (pointing satellite0 phenomenon37)
   added: (pointing satellite0 phenomenon30)
   goals met: 20 of 32
55. (take_image satellite0 phenomenon30 instrument2 thermograph5)
   added: (have_image phenomenon30 thermograph5)
   goals met: 21 of 32
56. (turn_to satellite4 planet16 planet32)
   deleted: (pointing satellite4 planet32)
   added: (pointing satellite4 planet16)
   goals met: 21 of 32
57. (turn_to satellite3 planet36 planet33)
   deleted: (pointing satellite3 planet33)
   added: (pointing satellite3 planet36)
   goals met: 21 of 32
58. (take_image satellite4 planet16 instrument19 image0)
   added: (have_image planet16 image0)
   goals met: 22 of 32
59. (turn_to satellite0 phenomenon37 phenomenon30)
   deleted: (pointing satellite0 phenomenon30)
   added: (pointing satellite0 phenomenon37)
   goals met: 23 of 32
60. (take_image satellite3 planet36 instrument15 spectrograph2)
   added: (have_image planet36 spectrograph2)
   goals met: 24 of 32
61. (turn_to satellite4 planet33 planet16)
   deleted: (pointing satellite4 planet16)
   added: (pointing satellite4 planet33)
   goals met: 24 of 32
62. (turn_to satellite0 planet23 phenomenon37)
   deleted: (pointing satellite0 phenomenon37)
   added: (pointing satellite0 planet23)
   goals met: 23 of 32
63. (turn_to satellite3 star35 planet36)
   deleted: (pointing satellite3 planet36)
   added: (pointing satellite3 star35)
   goals met: 23 of 32
64. (take_image satellite0 planet23 instrument2 thermograph5)
   added: (have_image planet23 thermograph5)
   goals met: 24 of 32
65. (take_image satellite4 planet33 instrument19 spectrograph1)
   added: (have_image planet33 spectrograph1)
   goals met: 25 of 32
66. (take_image satellite3 star35 instrument15 spectrograph2)
   added: (have_image star35 spectrograph2)
   goals met: 26 of 32
67. (turn_to satellite0 planet26 planet23)
   deleted: (pointing satellite0 planet23)
   added: (pointing satellite0 planet26)
   goals met: 26 of 32
68. (turn_to satellite4 star34 planet33)
   deleted: (pointing satellite4 planet33)
   added: (pointing satellite4 star34)
   goals met: 26 of 32
69. (take_image satellite0 planet26 instrument2 infrared3)
   added: (have_image planet26 infrared3)
   goals met: 27 of 32
70. (take_image satellite4 star34 instrument19 spectrograph1)
   added: (have_image star34 spectrograph1)
   goals met: 28 of 32
71. (turn_to satellite0 star20 planet26)
   deleted: (pointing satellite0 planet26)
   added: (pointing satellite0 star20)
   goals met: 28 of 32
72. (take_image satellite0 star20 instrument2 infrared3)
   added: (have_image star20 infrared3)
   goals met: 29 of 32
73. (turn_to satellite0 planet32 star20)
   deleted: (pointing satellite0 star20)
   added: (pointing satellite0 planet32)
   goals met: 29 of 32
74. (take_image satellite0 planet32 instrument2 infrared3)
   added: (have_image planet32 infrared3)
   goals met: 30 of 32
75. (turn_to satellite0 star15 planet32)
   deleted: (pointing satellite0 planet32)
   added: (pointing satellite0 star15)
   goals met: 30 of 32
76. (take_image satellite0 star15 instrument2 thermograph5)
   added: (have_image star15 thermograph5)
   goals met: 31 of 32
77. (turn_to satellite0 phenomenon37 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 phenomenon37)
   goals met: 32 of 32
